In [3]:
import pandas as pd
import numpy as np

In [70]:
df_brands = pd.read_csv('data/ecommerce_brands.csv')
df_categories = pd.read_csv('data/ecommerce_categories.csv')
df_customers = pd.read_csv('data/ecommerce_customers.csv')
df_inventory = pd.read_csv('data/ecommerce_inventory.csv')
df_order_items = pd.read_csv('data/ecommerce_order_items.csv')
df_orders = pd.read_csv('data/ecommerce_orders.csv')
df_products = pd.read_csv('data/ecommerce_products.csv')
df_promotions = pd.read_csv('data/ecommerce_promotions.csv')
df_reviews = pd.read_csv('data/ecommerce_reviews.csv')
df_ecommerce_warehouses = pd.read_csv('data/ecommerce_warehouses.csv')

## Exploracion

In [7]:
df_brands.info()
df_brands.describe()
df_brands.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   brand_id           15 non-null     int64
 1   brand_name         15 non-null     object
 2   country_of_origin  15 non-null     object
 3   founded_year       15 non-null     int64
 4   website            15 non-null     object
 5   is_premium         15 non-null     bool
dtypes: bool(1), int64(2), object(3)
memory usage: 747.0+ bytes

brand_id             0
brand_name           0
country_of_origin    0
founded_year         0
website              0
is_premium           0
dtype: int64

In [11]:
df_categories.info()
df_categories.describe()
df_categories.isnull().sum()
df_categories.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   category_id         10 non-null     int64
 1   category_name       10 non-null     object
 2   description         10 non-null     object
 3   parent_category_id  0 non-null      float64
 4   is_active           10 non-null     bool
 5   display_order       10 non-null     int64
dtypes: bool(1), float64(1), int64(2), object(2)
memory usage: 542.0+ bytes

,category_id,category_name,description,parent_category_id,is_active,display_order
0,1,Electrónica,Productos de electrónica,NaN,True,1
1,2,Ropa,Productos de ropa,NaN,False,2
2,3,Hogar,Productos de hogar,NaN,True,3
3,4,Deportes,Productos de deportes,NaN,True,4
4,5,Libros,Productos de libros,NaN,True,5

In [9]:
df_ecommerce_warehouses.info()
df_ecommerce_warehouses.describe()
df_ecommerce_warehouses.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   warehouse_id       5 non-null      int64
 1   warehouse_name     5 non-null      object
 2   location           5 non-null      object
 3   capacity_units     5 non-null      int64
 4   current_occupancy  5 non-null      int64
 5   manager_name       5 non-null      object
dtypes: int64(3), object(3)
memory usage: 372.0+ bytes

warehouse_id         0
warehouse_name       0
location             0
capacity_units       0
current_occupancy    0
manager_name         0
dtype: int64

In [6]:
df_reviews.info()
df_reviews.describe()
df_reviews.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   review_id             200 non-null    int64
 1   product_id            200 non-null    int64
 2   customer_id           200 non-null    int64
 3   rating                200 non-null    int64
 4   title                 200 non-null    object
 5   comment               200 non-null    object
 6   is_verified_purchase  200 non-null    bool
 7   helpful_votes         200 non-null    int64
 8   created_at            200 non-null    object
dtypes: bool(1), int64(5), object(3)
memory usage: 12.8+ KB

review_id               0
product_id              0
customer_id             0
rating                  0
title                   0
comment                 0
is_verified_purchase    0
helpful_votes           0
created_at              0
dtype: int64

In [71]:
df_promotions.info()
df_promotions.describe()
df_promotions.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   promotion_id      10 non-null     int64
 1   promotion_code    10 non-null     object
 2   promotion_name    10 non-null     object
 3   promotion_type    10 non-null     object
 4   discount_value    10 non-null     int64
 5   min_order_amount  10 non-null     int64
 6   max_uses          10 non-null     int64
 7   current_uses      10 non-null     int64
 8   start_date        10 non-null     object
 9   end_date          10 non-null     object
 10  is_active         10 non-null     bool
dtypes: bool(1), int64(5), object(5)
memory usage: 942.0+ bytes

promotion_id        0
promotion_code      0
promotion_name      0
promotion_type      0
discount_value      0
min_order_amount    0
max_uses            0
current_uses        0
start_date          0
end_date            0
is_active           0
dtype: int64

In [13]:
df_products.info()
df_products.describe()
df_products.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    100 non-null    int64
 1   sku           100 non-null    object
 2   product_name  100 non-null    object
 3   description   100 non-null    object
 4   category_id   100 non-null    int64
 5   brand_id      100 non-null    int64
 6   supplier_id   100 non-null    int64
 7   price         100 non-null    float64
 8   cost          100 non-null    float64
 9   weight_kg     100 non-null    float64
 10  is_active     100 non-null    bool
 11  created_at    100 non-null    object
 12  updated_at    100 non-null    object
dtypes: bool(1), float64(3), int64(4), object(5)
memory usage: 9.6+ KB

product_id      0
sku             0
product_name    0
description     0
category_id     0
brand_id        0
supplier_id     0
price           0
cost            0
weight_kg       0
is_active       0
created_at      0
updated_at      0
dtype: int64

In [14]:
df_orders.info()
df_orders.describe()
df_orders.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          5000 non-null   int64
 1   order_number      5000 non-null   object
 2   customer_id       5000 non-null   int64
 3   order_date        5000 non-null   object
 4   status            5000 non-null   object
 5   subtotal          5000 non-null   float64
 6   discount_percent  5000 non-null   int64
 7   shipping_cost     5000 non-null   int64
 8   tax_amount        5000 non-null   float64
 9   total_amount      5000 non-null   float64
 10  payment_method    5000 non-null   object
 11  shipping_method   5000 non-null   object
 12  promotion_id      1269 non-null   float64
 13  notes             786 non-null    object
dtypes: float64(4), int64(4), object(6)
memory usage: 547.0+ KB

order_id               0
order_number           0
customer_id            0
order_date             0
status                 0
subtotal               0
discount_percent       0
shipping_cost          0
tax_amount             0
total_amount           0
payment_method         0
shipping_method        0
promotion_id        3731
notes               4214
dtype: int64

In [15]:
df_order_items.info()
df_order_items.describe()
df_order_items.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14900 entries, 0 to 14899
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_item_id  14900 non-null  int64
 1   order_id       14900 non-null  int64
 2   product_id     14900 non-null  int64
 3   quantity       14900 non-null  int64
 4   unit_price     14900 non-null  float64
 5   subtotal       14900 non-null  float64
dtypes: float64(2), int64(4)
memory usage: 698.6 KB

order_item_id    0
order_id         0
product_id       0
quantity         0
unit_price       0
subtotal         0
dtype: int64

In [16]:
df_inventory.info()
df_inventory.describe()
df_inventory.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185 entries, 0 to 184
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   inventory_id       185 non-null    int64
 1   product_id         185 non-null    int64
 2   warehouse_id       185 non-null    int64
 3   quantity           185 non-null    int64
 4   min_stock_level    185 non-null    int64
 5   max_stock_level    185 non-null    int64
 6   last_restock_date  185 non-null    object
dtypes: int64(6), object(1)
memory usage: 10.2+ KB

inventory_id         0
product_id           0
warehouse_id         0
quantity             0
min_stock_level      0
max_stock_level      0
last_restock_date    0
dtype: int64

In [17]:
df_customers.info()
df_customers.describe()
df_customers.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        500 non-null    int64
 1   first_name         500 non-null    object
 2   last_name          500 non-null    object
 3   email              500 non-null    object
 4   phone              500 non-null    object
 5   birth_date         500 non-null    object
 6   city               500 non-null    object
 7   country            500 non-null    object
 8   postal_code        500 non-null    int64
 9   segment            500 non-null    object
 10  registration_date  500 non-null    object
 11  last_login         500 non-null    object
 12  is_verified        500 non-null    bool
 13  accepts_marketing  500 non-null    int64
dtypes: bool(1), int64(3), object(10)
memory usage: 51.4+ KB

customer_id          0
first_name           0
last_name            0
email                0
phone                0
birth_date           0
city                 0
country              0
postal_code          0
segment              0
registration_date    0
last_login           0
is_verified          0
accepts_marketing    0
dtype: int64

## Valore nulos
Hay que revisar las tablas categories y orders

* categories: Al faltarle a todas las filas los valores de la columna 'parent_category_id' da la pauta de que ninguna tiene alguna categoría padre por lo que esa columna no proporciona informacion alguna. De querer establecer alguna categoría padre hay que hacerlo a mano.
* orders:
    - En cuanto al promotion_id el significado de tener el valor NaN da a entender que no tiene ninguna promoción esa order por lo que se lo puede reemplazar con un 0 ya que las promotion_id empiezan desde el id 1.
    - En cuanto a 'notes' el valor Nan refleja que no existe ninguna nota sobre esa orden se puede agregar el el string "-" para simbolizar que no hay.

    En ambos casos se puede dejar el valor NaN pero hay que considerarlos para futuras consultas.

In [23]:
df_categories.drop(columns=['parent_category_id'], inplace=True)

In [18]:
df_orders.head()

,order_id,order_number,customer_id,order_date,status,subtotal,discount_percent,shipping_cost,tax_amount,total_amount,payment_method,shipping_method,promotion_id,notes
0,1,ORD-20230703-00001,383,2023-07-03,entregado,1674.84,15,440,351.72,2215.33,credit_card,same_day,6.0,NaN
1,2,ORD-20251107-00002,311,2025-11-07,enviado,201.91,2,190,42.40,430.27,bank_transfer,standard,NaN,NaN
2,3,ORD-20230209-00003,83,2023-02-09,cancelado,573.00,9,390,120.33,1031.76,paypal,same_day,NaN,NaN
3,4,ORD-20240612-00004,227,2024-06-12,procesando,2552.08,7,110,535.94,3019.37,paypal,express,9.0,Nota del cliente: Llamar antes
4,5,ORD-20231213-00005,28,2023-12-13,cancelado,2547.01,0,330,534.87,3411.88,credit_card,same_day,NaN,NaN

In [19]:
df_pormotions.head()

,promotion_id,promotion_code,promotion_name,promotion_type,discount_value,min_order_amount,max_uses,current_uses,start_date,end_date,is_active
0,1,PROMO6358A2,Promoción 1,buy_x_get_y,38,370,4582,180,2024-03-08,2024-03-15,True
1,2,PROMO2ED65D,Promoción 2,fixed_amount,28,480,7699,48,2024-05-31,2024-06-18,True
2,3,PROMOB30242,Promoción 3,fixed_amount,16,450,3975,261,2024-05-08,2024-07-20,True
3,4,PROMOA51044,Promoción 4,percentage,42,10,9686,418,2024-02-05,2024-03-26,True
4,5,PROMO7C94D8,Promoción 5,buy_x_get_y,29,660,9676,311,2024-04-26,2024-06-02,True

## Duplicados

In [24]:
df_orders.duplicated().sum()

np.int64(0)

In [25]:
df_brands.duplicated().sum()

np.int64(0)

In [26]:
df_categories.duplicated().sum()

np.int64(0)

In [27]:
df_customers.duplicated().sum()

np.int64(0)

In [28]:
df_inventory.duplicated().sum()

np.int64(0)

In [29]:
df_order_items.duplicated().sum()

np.int64(0)

In [30]:
df_products.duplicated().sum()

np.int64(0)

In [ ]:
df_promotions.duplicated().sum()

np.int64(0)

In [32]:
df_reviews.duplicated().sum()

np.int64(0)

In [33]:
df_ecommerce_warehouses.duplicated().sum()

np.int64(0)

## Correción de tipos

In [38]:
df_brands.info()
df_brands.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   brand_id           15 non-null     int64
 1   brand_name         15 non-null     object
 2   country_of_origin  15 non-null     object
 3   founded_year       15 non-null     int64
 4   website            15 non-null     object
 5   is_premium         15 non-null     bool
dtypes: bool(1), int64(2), object(3)
memory usage: 747.0+ bytes

,brand_id,brand_name,country_of_origin,founded_year,website,is_premium
0,1,TechPro,USA,2002,https://www.techpro.com,False
1,2,StyleMax,Japón,1971,https://www.stylemax.com,False
2,3,HomeLife,Brasil,1988,https://www.homelife.com,False
3,4,SportElite,Japón,1968,https://www.sportelite.com,False
4,5,BookWorld,USA,1956,https://www.bookworld.com,False

In [37]:
df_categories.info()
df_categories.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   category_id    10 non-null     int64
 1   category_name  10 non-null     object
 2   description    10 non-null     object
 3   is_active      10 non-null     bool
 4   display_order  10 non-null     int64
dtypes: bool(1), int64(2), object(2)
memory usage: 462.0+ bytes

,category_id,category_name,description,is_active,display_order
0,1,Electrónica,Productos de electrónica,True,1
1,2,Ropa,Productos de ropa,False,2
2,3,Hogar,Productos de hogar,True,3
3,4,Deportes,Productos de deportes,True,4
4,5,Libros,Productos de libros,True,5

In [52]:
df_customers.info()
df_customers.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        500 non-null    int64
 1   first_name         500 non-null    object
 2   last_name          500 non-null    object
 3   email              500 non-null    object
 4   phone              500 non-null    object
 5   birth_date         500 non-null    datetime64[ns]
 6   city               500 non-null    object
 7   country            500 non-null    object
 8   postal_code        500 non-null    int64
 9   segment            500 non-null    category
 10  registration_date  500 non-null    datetime64[ns]
 11  last_login         500 non-null    datetime64[ns]
 12  is_verified        500 non-null    bool
 13  accepts_marketing  500 non-null    bool
dtypes: bool(2), category(1), datetime64[ns](3), int64(2), object(6)
memory usage: 44.8+ KB

,customer_id,first_name,last_name,email,phone,birth_date,city,country,postal_code,segment,registration_date,last_login,is_verified,accepts_marketing
0,1,Valentina,Fernández,valentina.fernández1@email.com,+1 639-239-2381,1984-08-25,Salta,México,19387,Gold,2020-05-14,2021-01-05,True,False
1,2,Camila,Ramírez,camila.ramírez2@email.com,+1 582-218-5315,1999-03-17,Rosario,Uruguay,54172,Silver,2023-12-19,2024-08-15,True,False
2,3,Diego,Sánchez,diego.sánchez3@email.com,+1 443-763-3330,1997-07-31,Rosario,Uruguay,68680,Bronze,2023-02-03,2024-05-24,True,False
3,4,Lucas,Ramírez,lucas.ramírez4@email.com,+1 678-224-5920,1990-08-19,Santa Fe,Uruguay,58360,Bronze,2024-02-20,2025-09-29,False,False
4,5,Camila,López,camila.lópez5@email.com,+1 725-662-8264,2001-11-08,Córdoba,Argentina,37810,Bronze,2022-09-16,2025-10-22,True,False

In [51]:

df_customers['birth_date'] = pd.to_datetime(df_customers['birth_date'])
df_customers['segment'] = df_customers['segment'].astype('category')
df_customers['registration_date'] = pd.to_datetime(df_customers['registration_date'])
df_customers['last_login'] = pd.to_datetime(df_customers['last_login'])
df_customers['accepts_marketing'] = df_customers['accepts_marketing'].astype('bool')

In [55]:
df_inventory.info()
df_inventory.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185 entries, 0 to 184
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   inventory_id       185 non-null    int64
 1   product_id         185 non-null    int64
 2   warehouse_id       185 non-null    int64
 3   quantity           185 non-null    int64
 4   min_stock_level    185 non-null    int64
 5   max_stock_level    185 non-null    int64
 6   last_restock_date  185 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(6)
memory usage: 10.2 KB

,inventory_id,product_id,warehouse_id,quantity,min_stock_level,max_stock_level,last_restock_date
0,1,1,1,314,13,944,2025-07-06
1,2,1,2,152,20,419,2025-11-21
2,3,2,4,451,17,420,2024-10-11
3,4,2,4,210,16,232,2024-07-03
4,5,2,5,13,20,706,2024-03-22

In [54]:
df_inventory['last_restock_date'] = pd.to_datetime(df_inventory['last_restock_date'])

In [56]:
df_order_items.info()
df_order_items.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14900 entries, 0 to 14899
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_item_id  14900 non-null  int64
 1   order_id       14900 non-null  int64
 2   product_id     14900 non-null  int64
 3   quantity       14900 non-null  int64
 4   unit_price     14900 non-null  float64
 5   subtotal       14900 non-null  float64
dtypes: float64(2), int64(4)
memory usage: 698.6 KB

   order_item_id  order_id  product_id  quantity  unit_price  subtotal
0              1         1          51         4      418.71   1674.84
1              2         2          67         1      190.73    190.73
2              3         2          25         1       11.18     11.18
3              4         3          16         3      191.00    573.00
4              5         4           7         3      433.96   1301.88

In [64]:
df_orders.info()
df_orders.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          5000 non-null   int64
 1   order_number      5000 non-null   object
 2   customer_id       5000 non-null   int64
 3   order_date        5000 non-null   datetime64[ns]
 4   status            5000 non-null   category
 5   subtotal          5000 non-null   float64
 6   discount_percent  5000 non-null   int64
 7   shipping_cost     5000 non-null   int64
 8   tax_amount        5000 non-null   float64
 9   total_amount      5000 non-null   float64
 10  payment_method    5000 non-null   category
 11  shipping_method   5000 non-null   category
 12  promotion_id      1269 non-null   Int64
 13  notes             786 non-null    object
dtypes: Int64(1), category(3), datetime64[ns](1), float64(3), int64(4), object(2)
memory usage: 450.0+ KB

,order_id,order_number,customer_id,order_date,status,subtotal,discount_percent,shipping_cost,tax_amount,total_amount,payment_method,shipping_method,promotion_id,notes
0,1,ORD-20230703-00001,383,2023-07-03,entregado,1674.84,15,440,351.72,2215.33,credit_card,same_day,6,NaN
1,2,ORD-20251107-00002,311,2025-11-07,enviado,201.91,2,190,42.40,430.27,bank_transfer,standard,<NA>,NaN
2,3,ORD-20230209-00003,83,2023-02-09,cancelado,573.00,9,390,120.33,1031.76,paypal,same_day,<NA>,NaN
3,4,ORD-20240612-00004,227,2024-06-12,procesando,2552.08,7,110,535.94,3019.37,paypal,express,9,Nota del cliente: Llamar antes
4,5,ORD-20231213-00005,28,2023-12-13,cancelado,2547.01,0,330,534.87,3411.88,credit_card,same_day,<NA>,NaN

In [63]:
df_orders['order_date'] = pd.to_datetime(df_orders['order_date'])
df_orders['status'] = df_orders['status'].astype('category')
df_orders['payment_method'] = df_orders['payment_method'].astype('category')
df_orders['shipping_method'] = df_orders['shipping_method'].astype('category')
df_orders['promotion_id'] = df_orders['promotion_id'].astype('Int64')

In [67]:
df_products.info()
df_products.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    100 non-null    int64
 1   sku           100 non-null    object
 2   product_name  100 non-null    object
 3   description   100 non-null    object
 4   category_id   100 non-null    int64
 5   brand_id      100 non-null    int64
 6   supplier_id   100 non-null    int64
 7   price         100 non-null    float64
 8   cost          100 non-null    float64
 9   weight_kg     100 non-null    float64
 10  is_active     100 non-null    bool
 11  created_at    100 non-null    datetime64[ns]
 12  updated_at    100 non-null    datetime64[ns]
dtypes: bool(1), datetime64[ns](2), float64(3), int64(4), object(3)
memory usage: 9.6+ KB

,product_id,sku,product_name,description,category_id,brand_id,supplier_id,price,cost,weight_kg,is_active,created_at,updated_at
0,1,SKU-000001,Mega Set 1,Descripción detallada del producto 1,10,11,2,222.00,106.56,40.4,True,2022-02-03,2024-04-14
1,2,SKU-000002,Elite Pack 2,Descripción detallada del producto 2,4,7,2,53.34,26.14,2.1,True,2023-09-21,2024-02-24
2,3,SKU-000003,Elite Gadget 3,Descripción detallada del producto 3,7,14,2,257.12,149.13,41.0,True,2022-10-24,2025-11-15
3,4,SKU-000004,Básico Equipo 4,Descripción detallada del producto 4,9,5,5,92.04,53.38,3.3,True,2023-12-01,2025-12-24
4,5,SKU-000005,Mega Gadget 5,Descripción detallada del producto 5,9,6,5,339.29,234.11,31.1,True,2022-01-31,2024-09-02

In [66]:
df_products['created_at'] = pd.to_datetime(df_products['created_at'])
df_products['updated_at'] = pd.to_datetime(df_products['updated_at'])

In [ ]:
df_promotions.info()
df_promotions.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   promotion_id      10 non-null     int64
 1   promotion_code    10 non-null     object
 2   promotion_name    10 non-null     object
 3   promotion_type    10 non-null     object
 4   discount_value    10 non-null     int64
 5   min_order_amount  10 non-null     int64
 6   max_uses          10 non-null     int64
 7   current_uses      10 non-null     int64
 8   start_date        10 non-null     object
 9   end_date          10 non-null     object
 10  is_active         10 non-null     bool
dtypes: bool(1), int64(5), object(5)
memory usage: 942.0+ bytes

,promotion_id,promotion_code,promotion_name,promotion_type,discount_value,min_order_amount,max_uses,current_uses,start_date,end_date,is_active
0,1,PROMO6358A2,Promoción 1,buy_x_get_y,38,370,4582,180,2024-03-08,2024-03-15,True
1,2,PROMO2ED65D,Promoción 2,fixed_amount,28,480,7699,48,2024-05-31,2024-06-18,True
2,3,PROMOB30242,Promoción 3,fixed_amount,16,450,3975,261,2024-05-08,2024-07-20,True
3,4,PROMOA51044,Promoción 4,percentage,42,10,9686,418,2024-02-05,2024-03-26,True
4,5,PROMO7C94D8,Promoción 5,buy_x_get_y,29,660,9676,311,2024-04-26,2024-06-02,True

In [72]:
df_promotions['start_date'] = pd.to_datetime(df_promotions['start_date'])
df_promotions['end_date'] = pd.to_datetime(df_promotions['end_date'])

In [73]:
df_reviews.info()
df_reviews.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   review_id             200 non-null    int64
 1   product_id            200 non-null    int64
 2   customer_id           200 non-null    int64
 3   rating                200 non-null    int64
 4   title                 200 non-null    object
 5   comment               200 non-null    object
 6   is_verified_purchase  200 non-null    bool
 7   helpful_votes         200 non-null    int64
 8   created_at            200 non-null    object
dtypes: bool(1), int64(5), object(3)
memory usage: 12.8+ KB

,review_id,product_id,customer_id,rating,title,comment,is_verified_purchase,helpful_votes,created_at
0,1,21,222,2,Cumple expectativas,No cumplió mis expectativas.,True,7,2023-04-05
1,2,77,360,2,Recomendado,No cumplió mis expectativas.,True,18,2025-12-30
2,3,99,305,2,Buena calidad,El producto es correcto pero la entrega tardó.,True,12,2024-11-05
3,4,1,278,3,Excelente producto,No cumplió mis expectativas.,True,15,2023-08-29
4,5,63,267,4,Excelente producto,El producto es correcto pero la entrega tardó.,True,7,2024-08-05

In [74]:
df_reviews['created_at'] = pd.to_datetime(df_reviews['created_at'])

In [75]:
df_ecommerce_warehouses.info()
df_ecommerce_warehouses.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   warehouse_id       5 non-null      int64
 1   warehouse_name     5 non-null      object
 2   location           5 non-null      object
 3   capacity_units     5 non-null      int64
 4   current_occupancy  5 non-null      int64
 5   manager_name       5 non-null      object
dtypes: int64(3), object(3)
memory usage: 372.0+ bytes

,warehouse_id,warehouse_name,location,capacity_units,current_occupancy,manager_name
0,1,Depósito 1,Buenos Aires,24505,87,Laura Torres
1,2,Depósito 2,Córdoba,23278,50,Sofía Ramírez
2,3,Depósito 3,Rosario,77607,62,Sofía Ramírez
3,4,Depósito 4,Mendoza,43167,70,Laura Torres
4,5,Depósito 5,La Plata,65023,82,Laura Torres

## Preguntas de negocio

1) Top 5 clientes por gasto total
2) Producto más vendido
3) Evolución mensual de ventas